
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_private_endpoint.ped_web_pubsub_private_endpoint
  * module.em-icp-redis-cache[0].azurerm_redis_cache.redis
* Replace
  * azurerm_role_assignment.web_pubsub_service_owner[&#34;192df417-f2be-4bd9-8e3e-c08b6e4cb0b8&#34;]
  * azurerm_role_assignment.web_pubsub_service_owner[&#34;3689a22e-1785-4944-bd9e-113355bfb070&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_private_endpoint.ped_web_pubsub_private_endpoint will be updated in-place
  ~ resource "azurerm_private_endpoint" "ped_web_pubsub_private_endpoint" {
        id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/privateEndpoints/em-icp-aat-privateendpoint"
        name                          = "em-icp-aat-privateendpoint"
      ~ tags                          = {
          - "application"  = "core" -> null
          - "builtFrom"    = "hmcts/aks-cft-deploy" -> null
          - "businessArea" = "CFT" -> null
          - "environment"  = "staging" -> null
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_role_assignment.web_pubsub_service_owner["192df417-f2be-4bd9-8e3e-c08b6e4cb0b8"] must be replaced
-/+ resource "azurerm_role_assignment" "web_pubsub_service_owner" {
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-aat/providers/Microsoft.SignalRService/webPubSub/em-icp-webpubsub-aat/providers/Microsoft.Authorization/roleAssignments/52ccee48-07b1-500f-1602-1debefe64813" -> (known after apply)
      ~ name                                   = "52ccee48-07b1-500f-1602-1debefe64813" -> (known after apply)
      ~ principal_type                         = "User" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/12cf5a90-567b-43ae-8102-96cf46c7d9b4" -> (known after apply)
      ~ role_definition_name                   = "Web PubSub Service Owner" -> "Contributor" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.web_pubsub_service_owner["3689a22e-1785-4944-bd9e-113355bfb070"] must be replaced
-/+ resource "azurerm_role_assignment" "web_pubsub_service_owner" {
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-aat/providers/Microsoft.SignalRService/webPubSub/em-icp-webpubsub-aat/providers/Microsoft.Authorization/roleAssignments/76125dd6-f64b-d72d-21a7-f8a1eafdcc9e" -> (known after apply)
      ~ name                                   = "76125dd6-f64b-d72d-21a7-f8a1eafdcc9e" -> (known after apply)
      ~ principal_type                         = "User" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/12cf5a90-567b-43ae-8102-96cf46c7d9b4" -> (known after apply)
      ~ role_definition_name                   = "Web PubSub Service Owner" -> "Contributor" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.em-icp-redis-cache[0].azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-redis-cache-cache-aat/providers/Microsoft.Cache/redis/em-icp-redis-cache-aat"
        name                               = "em-icp-redis-cache-aat"
        tags                               = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "staging"
            "managedBy"           = "Evidence Management"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          - data_persistence_authentication_method  = "SAS" -> null
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (13 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1495,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->